Autodesk.Revit.DB.SolidGeometry
An enumerated type listing possible ways of exporting solids in 3D views.

Autodesk.Revit.DB.SolidGeometry.ACIS
All visible Revit Building geometry is exported as ACIS 3D solids
(except for any elements that are already a polymesh.)

Autodesk.Revit.DB.SolidGeometry.Polymesh
All visible solids are exported as polymesh.